---
kind: type
id: T:Autodesk.Revit.DB.Structure.LoadTypeBase
source: html/01b08561-f396-1475-6e90-05c2e9f41d48.htm
---
# Autodesk.Revit.DB.Structure.LoadTypeBase

The base class for LoadTypes

## Syntax (C#)
```csharp
public class LoadTypeBase : ElementType
```